MUDAL/Self-driving-Toy-Car/Toy_Car_STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define servo_Pin GPIO_PIN_0
#define servo_GPIO_Port GPIOA
#define leftMotor2_Pin GPIO_PIN_4
#define leftMotor2_GPIO_Port GPIOA
#define rightMotor2_Pin GPIO_PIN_5
#define rightMotor2_GPIO_Port GPIOA
#define trig_Pin GPIO_PIN_6
#define trig_GPIO_Port GPIOA
#define leftPWM_Pin GPIO_PIN_0
#define leftPWM_GPIO_Port GPIOB
#define rightPWM_Pin GPIO_PIN_1
#define rightPWM_GPIO_Port GPIOB
#define LED_Pin GPIO_PIN_11
#define LED_GPIO_Port GPIOB
#define leftMotor_Pin GPIO_PIN_14
#define leftMotor_GPIO_Port GPIOB
#define rightMotor_Pin GPIO_PIN_15
#define rightMotor_GPIO_Port GPIOB
#define bluetooth_Pin GPIO_PIN_10
#define bluetooth_GPIO_Port GPIOA
#define echo_Pin GPIO_PIN_6
#define echo_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
